In [1]:
people = {
    'first' : ['Alex', 'Donald', 'Phillipa', 'Jane', 'John', 'Alan'],
    'last' : ['McIntosh', 'Smith', 'Jones', 'Baker', 'Doe', 'Doe'],
    'email' : ['alexmc124@gmail.com','donald88@aol.com','philjones@gmail.com','janebaker@aol.com', 'JohnDoe@email.com', 'AlanDoe@email.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

      first      last                email
0      Alex  McIntosh  alexmc124@gmail.com
1    Donald     Smith     donald88@aol.com
2  Phillipa     Jones  philjones@gmail.com
3      Jane     Baker    janebaker@aol.com
4      John       Doe    JohnDoe@email.com
5      Alan       Doe    AlanDoe@email.com

In [5]:
# Updating the Column Heading
df.columns = ['first_name','last_name','email']

In [6]:
df

  first_name last_name                email
0       Alex  McIntosh  alexmc124@gmail.com
1     Donald     Smith     donald88@aol.com
2   Phillipa     Jones  philjones@gmail.com
3       Jane     Baker    janebaker@aol.com
4       John       Doe    JohnDoe@email.com
5       Alan       Doe    AlanDoe@email.com

In [7]:
#change the column headers to be uppercase
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                EMAIL
0       Alex  McIntosh  alexmc124@gmail.com
1     Donald     Smith     donald88@aol.com
2   Phillipa     Jones  philjones@gmail.com
3       Jane     Baker    janebaker@aol.com
4       John       Doe    JohnDoe@email.com
5       Alan       Doe    AlanDoe@email.com

In [8]:
#change the column headers to be lowercase
df.columns = [x.lower() for x in df.columns]
df
# only change one column 
df.rename(columns={'first_name':'first','last_name':'last'}, inplace =True)

In [9]:
df

      first      last                email
0      Alex  McIntosh  alexmc124@gmail.com
1    Donald     Smith     donald88@aol.com
2  Phillipa     Jones  philjones@gmail.com
3      Jane     Baker    janebaker@aol.com
4      John       Doe    JohnDoe@email.com
5      Alan       Doe    AlanDoe@email.com

In [10]:
df.loc[2]

first               Phillipa
last                   Jones
email    philjones@gmail.com
Name: 2, dtype: object

In [11]:
df.loc[2] = ['Laura','Les','100@gec.com']

In [12]:
df.loc[2]

first          Laura
last             Les
email    100@gec.com
Name: 2, dtype: object

In [13]:
df.loc[2,['email']] = ['GECGECGEC@GEC.GEC']

In [14]:
df.loc[2]

first                Laura
last                   Les
email    GECGECGEC@GEC.GEC
Name: 2, dtype: object

In [15]:
#Can also be changed using the .at function 
df.at[2, 'last'] = 'Booty'
df

    first      last                email
0    Alex  McIntosh  alexmc124@gmail.com
1  Donald     Smith     donald88@aol.com
2   Laura     Booty    GECGECGEC@GEC.GEC
3    Jane     Baker    janebaker@aol.com
4    John       Doe    JohnDoe@email.com
5    Alan       Doe    AlanDoe@email.com

In [16]:
#Updating multiple rows of data
df['email'] = df['email'].str.lower()
df

    first      last                email
0    Alex  McIntosh  alexmc124@gmail.com
1  Donald     Smith     donald88@aol.com
2   Laura     Booty    gecgecgec@gec.gec
3    Jane     Baker    janebaker@aol.com
4    John       Doe    johndoe@email.com
5    Alan       Doe    alandoe@email.com

In [17]:
# using apply to use a funtion on each of the values in a series
df['email'].apply(len)

0    19
1    16
2    17
3    17
4    17
5    17
Name: email, dtype: int64

In [18]:
def update_email(email):
    return email.upper()

In [20]:
df['email'].apply(update_email)

0    ALEXMC124@GMAIL.COM
1       DONALD88@AOL.COM
2      GECGECGEC@GEC.GEC
3      JANEBAKER@AOL.COM
4      JOHNDOE@EMAIL.COM
5      ALANDOE@EMAIL.COM
Name: email, dtype: object

In [22]:
df['email'] = df['email'].apply(update_email)
df

    first      last                email
0    Alex  McIntosh  ALEXMC124@GMAIL.COM
1  Donald     Smith     DONALD88@AOL.COM
2   Laura     Booty    GECGECGEC@GEC.GEC
3    Jane     Baker    JANEBAKER@AOL.COM
4    John       Doe    JOHNDOE@EMAIL.COM
5    Alan       Doe    ALANDOE@EMAIL.COM

In [24]:
#same as above but using an anonymous fnction 
df['email'] = df['email'].apply(lambda x : x.lower())
df

    first      last                email
0    Alex  McIntosh  alexmc124@gmail.com
1  Donald     Smith     donald88@aol.com
2   Laura     Booty    gecgecgec@gec.gec
3    Jane     Baker    janebaker@aol.com
4    John       Doe    johndoe@email.com
5    Alan       Doe    alandoe@email.com

In [29]:
# this will just give us the length of the series 
df.apply(len)

first    6
last     6
email    6
dtype: int64

In [28]:
# this will just give us the number of values in a row
df.apply(len, axis='columns')

0    3
1    3
2    3
3    3
4    3
5    3
dtype: int64

In [30]:
df.apply(pd.Series.min)

first                 Alan
last                 Baker
email    alandoe@email.com
dtype: object

In [31]:
# Using apply on a series will apply to every value in the series 
# Running apply on a dataframe will apply to every series 
# to apply to elements in a dataframe we use applymap

df.applymap(len)

   first  last  email
0      4     8     19
1      6     5     16
2      5     5     17
3      4     5     17
4      4     3     17
5      4     3     17

In [32]:
df.applymap(str.lower)

    first      last                email
0    alex  mcintosh  alexmc124@gmail.com
1  donald     smith     donald88@aol.com
2   laura     booty    gecgecgec@gec.gec
3    jane     baker    janebaker@aol.com
4    john       doe    johndoe@email.com
5    alan       doe    alandoe@email.com

In [37]:
# Map -> will replace every value in a series 
df['first'].map({'Alex':'Steve', 'Donald': 'Andrew','Laura':'Jimothy','Jane':'Lipton','John':'Kim','Alan':'Dylan'})

0      Steve
1     Andrew
2    Jimothy
3     Lipton
4        Kim
5      Dylan
Name: first, dtype: object

In [39]:
# if we only want to change a few of the values we use the Replace method 
df['first'].replace({'Alex':'Steve', 'Donald': 'Andrew'})

0     Steve
1    Andrew
2     Laura
3      Jane
4      John
5      Alan
Name: first, dtype: object

In [40]:
df

    first      last                email
0    Alex  McIntosh  alexmc124@gmail.com
1  Donald     Smith     donald88@aol.com
2   Laura     Booty    gecgecgec@gec.gec
3    Jane     Baker    janebaker@aol.com
4    John       Doe    johndoe@email.com
5    Alan       Doe    alandoe@email.com